[M_Orchid_PlotMission09 MissionDefinition]
MissionDescription="Thanks to your efforts in [place]Magnys Lighthouse[-place], a big ol' beam of light is pointing at a particular spot in the [place]Wurmwater[-place] -- more than likely, this is where the Treasure of the Sands is buried. Captain Scarlett has asked you to meet her there -- together, the two of you will fight your way to the treasure, before eventually dueling one another to see who actually gets to keep it."
TurnInDescription="You defeated Scarlett, slew the Leviathan, and found the Lost Treasure of the Sands! All in all, a pretty busy day."
MissionSummary="Reach the lost Treasure of the Sands!"

[M_Orchid_PlotMission09:EscapeLeviathanDummySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="First, Scarlett betrayed you. Then, the Leviathan devoured you.<br><br>In order to reach the treasure of the Sands, you'll have to defeat Scarlett (who is now fighting from the back of her skyscraper-sized pet, Roscoe), escape from the belly of a thousand-year-old desert monster known as the Leviathan, right before killing it in single combat.<br><br>Good luck!"

[M_Orchid_PlotMission09:EscapeSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Escape Scarlett's ambush and reach the treasure!"
MissionDescriptionOverride="So, Scarlett betrayed you. Not a HUGE surprise, granted, but still pretty inconvenient. With her soldiers trying to snuff you at every turn, you really only have one option: kill 'em all, and try to reach the Lost Treasure of the Sands before Scarlett can."

[M_Orchid_PlotMission09:GotoTreasureEntrance MissionObjectiveDefinition]
ProgressMessage="Find treasure room"

[M_Orchid_PlotMission09:KillBossWorm MissionObjectiveDefinition]
ProgressMessage="Kill Leviathan"

[M_Orchid_PlotMission09:ResumeTreasureEntrance MissionObjectiveDefinition]
ProgressMessage="Find treasure room"
